package transcoder

var UNICODE_MAP = map[string]string{
	// No marks
	`α`: `a`,  // \u03b1
	`β`: `b`,  // \u03b2
	`γ`: `g`,  // \u03b3
	`δ`: `d`,  // \u03b4
	`ε`: `e`,  // \u03b5
	`ζ`: `z`,  // \u03b6
	`η`: `h`,  // \u03b7
	`θ`: `q`,  // \u03b8
	`ι`: `i`,  // \u03b9
	`κ`: `k`,  // \u03ba
	`λ`: `l`,  // \u03bb
	`μ`: `m`,  // \u03bc
	`ν`: `n`,  // \u03bd
	`ξ`: `c`,  // \u03be
	`ο`: `o`,  // \u03bf
	`π`: `p`,  // \u03c0
	`ρ`: `r`,  // \u03c1
	`σ`: `s`,  // \u03c3
	`ς`: `s2`, // \u03c2
	`ϲ`: `s3`, // \u03f2
	`τ`: `t`,  // \u03c4
	`υ`: `u`,  // \u03c5
	`φ`: `f`,  // \u03c6
	`χ`: `x`,  // \u03c7
	`ψ`: `y`,  // \u03c8
	`ω`: `w`,  // \u03c9

	// Capital Letters
	`Α`: `*a`,  // \u0391
	`Β`: `*b`,  // \u0392
	`Γ`: `*g`,  // \u0393
	`Δ`: `*d`,  // \u0394
	`Ε`: `*e`,  // \u0395
	`Ζ`: `*z`,  // \u0396
	`Η`: `*h`,  // \u0397
	`Θ`: `*q`,  // \u0398
	`Ι`: `*i`,  // \u0399
	`Κ`: `*k`,  // \u039a
	`Λ`: `*l`,  // \u039b
	`Μ`: `*m`,  // \u039c
	`Ν`: `*n`,  // \u039d
	`Ξ`: `*c`,  // \u039e
	`Ο`: `*o`,  // \u039f
	`Π`: `*p`,  // \u03a0
	`Ρ`: `*r`,  // \u03a1
	`Σ`: `*s`,  // \u03a3
	`Ϲ`: `*s3`, // \u03f9
	`Τ`: `*t`,  // \u03a4
	`Υ`: `*u`,  // \u03a5
	`Φ`: `*f`,  // \u03a6
	`Χ`: `*x`,  // \u03a7
	`Ψ`: `*y`,  // \u03a8
	`Ω`: `*w`,  // \u03a9

	// Smooth breathing
	`ἀ`: `a)`,  // \u1f00
	`ἐ`: `e)`,  // \u1f10
	`ἠ`: `h)`,  // \u1f20
	`ἰ`: `i)`,  // \u1f30
	`ὀ`: `o)`,  // \u1f40
	`ὐ`: `u)`,  // \u1f50
	`ὠ`: `w)`,  // \u1f60
	`ῤ`: `r)`,  // \u1fe4
	`Ἀ`: `*)a`, // \u1f08
	`Ἐ`: `*)e`, // \u1f18
	`Ἠ`: `*)h`, // \u1f28
	`Ἰ`: `*)i`, // \u1f38
	`Ὀ`: `*)o`, // \u1f48
	`Ὠ`: `*)w`, // \u1f68

	// Rough breathing
	`ἁ`: `a(`,  // \u1f01
	`ἑ`: `e(`,  // \u1f11
	`ἡ`: `h(`,  // \u1f21
	`ἱ`: `i(`,  // \u1f31
	`ὁ`: `o(`,  // \u1f41
	`ὑ`: `u(`,  // \u1f51
	`ὡ`: `w(`,  // \u1f61
	`ῥ`: `r(`,  // \u1fe5
	`Ἁ`: `*(a`, // \u1f09
	`Ἑ`: `*(e`, // \u1f19
	`Ἡ`: `*(h`, // \u1f29
	`Ἱ`: `*(i`, // \u1f39
	`Ὁ`: `*(o`, // \u1f49
	`Ὑ`: `*(u`, // \u1f59
	`Ὡ`: `*(w`, // \u1f69
	`Ῥ`: `*(r`, // \u1fec

	// Acute accent and grave accent
	`ὰ`: `a\\`,  // \u1f70
	`ά`: `a/`,   // \u1f71
	`ὲ`: `e\\`,  // \u1f72
	`έ`: `e/`,   // \u1f73
	`ὴ`: `h\\`,  // \u1f74
	`ή`: `h/`,   // \u1f75
	`ὶ`: `i\\`,  // \u1f76
	`ί`: `i/`,   // \u1f77
	`ὸ`: `o\\`,  // \u1f78
	`ό`: `o/`,   // \u1f79
	`ὺ`: `u\\`,  // \u1f7a
	`ύ`: `u/`,   // \u1f7b
	`ὼ`: `w\\`,  // \u1f7c
	`ώ`: `w/`,   // \u1f7d
	`Ὰ`: `*\\a`, // \u1fba
	`Ά`: `*/a`,  // \u1fbb
	`Ὲ`: `*\\e`, // \u1fce
	`Έ`: `*/e`,  // \u1fc9
	`Ὴ`: `*\\h`, // \u1fca
	`Ή`: `*/h`,  // \u1fcb
	`Ὶ`: `*\\i`, // \u1fda
	`Ί`: `*/i`,  // \u1fdb
	`Ὸ`: `*\\o`, // \u1ff8
	`Ό`: `*/o`,  // \u1ff9
	`Ὺ`: `*\\u`, // \u1fea
	`Ύ`: `*/u`,  // \u1feb
	`Ὼ`: `*\\w`, // \u1ffa
	`Ώ`: `*/w`,  // \u1ffb

	// Smooth breathing and acute accent

	`ἄ`:  `a)/`,  // \u1f04
	`ἔ`:  `e)/`,  // \u1f14
	`ἤ`:  `h)/`,  // \u1f24
	`ἴ`:  `i)/`,  // \u1f34
	`ὄ`:  `o)/`,  // \u1f44
	`ὔ`:  `u)/`,  // \u1f54
	`ὤ`:  `w)/`,  // \u1f64
	`Ἄ`:  `*)/a`, // \u1f0c
	`Ἔ`:  `*)/e`, // \u1f1c
	`Ἤ`:  `*)/h`, // \u1f2c
	`Ἴ`:  `*)/i`, // \u1f3c
	`Ὄ`:  `*)/o`, // \u1f4c
	`῎Υ`: `*)/u`, // \u1f5c
	`Ὤ`:  `*)/w`, // \u1f6c

	// Smooth breathing and grave accent
	`ἂ`:  `a)\\`,  // \u1f02
	`ἒ`:  `e)\\`,  // \u1f12
	`ἢ`:  `h)\\`,  // \u1f22
	`ἲ`:  `i)\\`,  // \u1f32
	`ὂ`:  `o)\\`,  // \u1f42
	`ὒ`:  `u)\\`,  // \u1f52
	`ὢ`:  `w)\\`,  // \u1f62
	`Ἂ`:  `*)\\a`, // \u1f0a
	`Ἒ`:  `*)\\e`, // \u1f1a
	`Ἢ`:  `*)\\h`, // \u1f2a
	`Ἲ`:  `*)\\i`, // \u1f3a
	`Ὂ`:  `*)\\o`, // \u1f4a
	`῍Υ`: `*)\\u`, // \u1f5a
	`Ὢ`:  `*)\\w`, // \u1f6a

	// Rough breathing and acute accent
	`ἅ`: `a(/`,  // \u1f05
	`ἕ`: `e(/`,  // \u1f15
	`ἥ`: `h(/`,  // \u1f25
	`ἵ`: `i(/`,  // \u1f35
	`ὅ`: `o(/`,  // \u1f45
	`ὕ`: `u(/`,  // \u1f55
	`ὥ`: `w(/`,  // \u1f65
	`Ἅ`: `*(/a`, // \u1f0d
	`Ἕ`: `*(/e`, // \u1f1d
	`Ἥ`: `*(/h`, // \u1f2d
	`Ἵ`: `*(/i`, // \u1f3d
	`Ὅ`: `*(/o`, // \u1f4d
	`Ὕ`: `*(/u`, // \u1f5d
	`Ὥ`: `*(/w`, // \u1f6d

	// Rough breathing and grave accent
	`ἃ`: `a(\\`,  // \u1f03
	`ἓ`: `e(\\`,  // \u1f13
	`ἣ`: `h(\\`,  // \u1f23
	`ἳ`: `i(\\`,  // \u1f33
	`ὃ`: `o(\\`,  // \u1f43
	`ὓ`: `u(\\`,  // \u1f53
	`ὣ`: `w(\\`,  // \u1f63
	`Ἃ`: `*(\\a`, // \u1f0b
	`Ἓ`: `*(\\e`, // \u1f1b
	`Ἣ`: `*(\\h`, // \u1f2b
	`Ἳ`: `*(\\i`, // \u1f3b
	`Ὃ`: `*(\\o`, // \u1f4b
	`Ὓ`: `*(\\u`, // \u1f5b
	`Ὣ`: `*(\\w`, // \u1f6b

	// Perispomeni
	`ᾶ`: `a=`, // \u1fb6
	`ῆ`: `h=`, // \u1fc6
	`ῖ`: `i=`, // \u1fd6
	`ῦ`: `u=`, // \u1fe6
	`ῶ`: `w=`, // \u1ff6

	// Smooth breathing and perispomeni
	`ἆ`: `a)=`,  // \u1f06
	`ἦ`: `h)=`,  // \u1f26
	`ἶ`: `i)=`,  // \u1f36
	`ὖ`: `u)=`,  // \u1f56
	`ὦ`: `w)=`,  // \u1f66
	`Ἆ`: `*)=a`, // \u1f0e
	`Ἦ`: `*)=h`, // \u1f2e
	`Ἶ`: `*)=i`, // \u1f3e
	`Ὦ`: `*)=w`, // \u1f6e

	// Rough breathing and perispomeni
	`ἇ`: `a(=`,  // \u1f07
	`ἧ`: `h(=`,  // \u1f27
	`ἷ`: `i(=`,  // \u1f37
	`ὗ`: `u(=`,  // \u1f57
	`ὧ`: `w(=`,  // \u1f67
	`Ἇ`: `*(=a`, // \u1f0f
	`Ἧ`: `*(=h`, // \u1f2f
	`Ἷ`: `*(=i`, // \u1f3f
	`Ὗ`: `*(=u`, // \u1f5f
	`Ὧ`: `*(=w`, // \u1f6f

	// Perispomeni and ypogegrammeni
	`ᾷ`: `a=|`, // \u1fb7
	`ῇ`: `h=|`, // \u1fc7
	`ῷ`: `w=|`, // \u1ff7

	// Ypogegrammeni
	`ᾳ`: `a|`,  // \u1fb3
	`ῃ`: `h|`,  // \u1fc3
	`ῳ`: `w|`,  // \u1ff3
	`ᾼ`: `*a|`, // \u1fbc
	`ῌ`: `*h|`, // \u1fcc
	`ῼ`: `*w|`, // \u1ffc

	// Acute accent and ypogegrammeni
	`ᾴ`: `a/|`, // \u1fb4
	`ῄ`: `h/|`, // \u1fc4
	`ῴ`: `w/|`, // \u1ff4

	// Smooth breathing and ypogegrammeni
	`ᾀ`: `a)|`,  // \u1f80
	`ᾐ`: `h)|`,  // \u1f90
	`ᾠ`: `w)|`,  // \u1fa0
	`ᾈ`: `*)a|`, // \u1f88
	`ᾘ`: `*)h|`, // \u1f98
	`ᾨ`: `*)w|`, // \u1fa8

	// Rough breathing and ypogegrammeni
	`ᾁ`: `a(|`,  // \u1f81
	`ᾑ`: `h(|`,  // \u1f91
	`ᾡ`: `w(|`,  // \u1fa1
	`ᾉ`: `*(a|`, // \u1f89
	`ᾙ`: `*(h|`, // \u1f99
	`ᾩ`: `*(w|`, // \u1fa9

	// Smooth breathing, acute accent, and ypogegrammeni
	`ᾂ`: `a)\|`,   // \u1f82
	`ᾒ`: `h)\|`,   // \u1f92
	`ᾢ`: `w)\|`,   // \u1fa2
	`ᾊ`: `*)\\a|`, // \u1f8a
	`ᾚ`: `*)\h|`,  // \u1f9a
	`ᾪ`: `*)\w|`,  // \u1faa

	// Rough breathing, grave accent, and ypogegrammeni
	`ᾃ`: `a(\\|`,   // \u1f83
	`ᾓ`: `h)\\|`,   // \u1f93
	`ᾣ`: `w)\\|`,   // \u1fa3
	`ᾋ`: `*(\\\a|`, // \u1f8b
	`ᾛ`: `*)\\h|`,  // \u1f9b
	`ᾫ`: `*)\\w|`,  // \u1fab

	// Smooth breathing, accute accent, and ypogegrammeni
	`ᾄ`: `a)/|`,  // \u1f84
	`ᾔ`: `h)/|`,  // \u1f94
	`ᾤ`: `w)/|`,  // \u1fa4
	`ᾌ`: `*)/a|`, // \u1f8c
	`ᾜ`: `*)/h|`, // \u1f9c
	`ᾬ`: `*)/w|`, // \u1fac

	// Rough breating, acute accent, and ypogegrammeni
	`ᾅ`: `a(/|`,  // \u1f85
	`ᾕ`: `h(/|`,  // \u1f95
	`ᾥ`: `w(/|`,  // \u1fa5
	`ᾍ`: `*(/a|`, // \u1f8d
	`ᾝ`: `*(/h|`, // \u1f9d
	`ᾭ`: `*(/w|`, // \u1fad

	// Smooth breathing, ypogegrammeni, and perispomeni
	`ᾆ`: `a)=|`,  // \u1f86
	`ᾖ`: `h)=|`,  // \u1f96
	`ᾦ`: `w)=|`,  // \u1fa6
	`ᾎ`: `*)=a|`, // \u1f8e
	`ᾞ`: `*)=h|`, // \u1f9e
	`ᾮ`: `*)=w|`, // \u1fae

	// Rough breathing, ypogegrammeni, and perispomeni
	`ᾇ`: `a(=|`,  // \u1f87
	`ᾗ`: `h(=|`,  // \u1f97
	`ᾧ`: `w(=|`,  // \u1fa7
	`ᾏ`: `*(=a|`, // \u1f8f
	`ᾟ`: `*(=h|`, // \u1f9f
	`ᾯ`: `*(=w|`, // \u1faf

	// Diaeresis
	`ϊ`: `i+`,   // \u03ca
	`Ϊ`: `*+i`,  // \u03aa
	`ῒ`: `i\\+`, // \u1fd2
	`ῗ`: `i=+`,  // \u1fd7
	`ϋ`: `u+`,   // \u03cb
	`Ϋ`: `*+u`,  // \u03ab
	`ῢ`: `u\\+`, // \u1fe2
	`ΰ`: `u/+`,  // \u1fe3
	`ῧ`: `u=+`,  // \u1fe7

	// Macron
	`ᾰ`: `a&`, // \u1fb0
	`ῐ`: `i&`, // \u1fd0
	`ῠ`: `u&`, // \u1fe0

	// Breve
	`ᾱ`: `a\'`, // \u1fb1
	`ῑ`: `i\'`, // \u1fd1
	`ῡ`: `u\'`, // \u1fe1

	// Basic punctuation
	`·`: `:`,  // \u00b7
	`’`: `\'`, // \u2019
	`‐`: `-`,  // \u2010
	`—`: `_`,  // \u2014
}
